internal/cli/testdata/golden/petstore/architecture.mmd
%% Architecture of petstore, generated by cloudcc.
flowchart LR
    aws_apigatewayv2_integration_pet_api["pet-api\napigatewayv2.integration"]
    aws_apigatewayv2_route_pet_api["pet-api\napigatewayv2.route"]
    aws_apigatewayv2_stage_pet_api["pet-api\napigatewayv2.stage"]
    aws_apigatewayv2_pet_api(["pet-api\napigatewayv2"])
    aws_cloudwatch_loggroup_main["main\ncloudwatch.loggroup"]
    aws_dynamodb_petsByOwner[("petsByOwner\ndynamodb")]
    aws_iam_policy_main["main\niam.policy"]
    aws_iam_role_main["main\niam.role"]
    aws_lambda_permission_pet_api["pet-api\nlambda.permission"]
    aws_lambda_main["main\nlambda"]
    aws_apigatewayv2_integration_pet_api --> aws_apigatewayv2_pet_api
    aws_apigatewayv2_integration_pet_api --> aws_lambda_main
    aws_apigatewayv2_route_pet_api --> aws_apigatewayv2_integration_pet_api
    aws_apigatewayv2_route_pet_api --> aws_apigatewayv2_pet_api
    aws_apigatewayv2_stage_pet_api --> aws_apigatewayv2_route_pet_api
    aws_apigatewayv2_stage_pet_api --> aws_apigatewayv2_pet_api
    aws_iam_policy_main --> aws_dynamodb_petsByOwner
    aws_iam_policy_main --> aws_iam_role_main
    aws_lambda_permission_pet_api --> aws_apigatewayv2_pet_api
    aws_lambda_permission_pet_api --> aws_lambda_main
    aws_lambda_main --> aws_cloudwatch_loggroup_main
    aws_lambda_main --> aws_iam_role_main
    aws_lambda_main -->|uses| aws_dynamodb_petsByOwner
